1sem/IA/testes/teste_2014-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-13 Mon 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teste 2014 15</title>
<meta name="author" content="Mari§" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Teste 2014 15</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org293700c">1. Grupo 1</a>
<ul>
<li><a href="#orgdbc8756">1.1. Questao 2</a></li>
</ul>
</li>
<li><a href="#org8f78206">2. Grupo 2</a></li>
<li><a href="#orgf2a95ad">3. Grupo 3</a></li>
</ul>
</div>
</div>

<div id="outline-container-org293700c" class="outline-2">
<h2 id="org293700c"><span class="section-number-2">1.</span> Grupo 1</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><p>
Caracterize e explique as decisões tomadas ao nível da representação do conhecimento;
</p>

<div class="org-src-container">
<pre class="src src-prolog">  aluno :: <span style="color: #e95678;">Id</span>, <span style="color: #e95678;">Nome</span>, <span style="color: #e95678;">Curso</span>, <span style="color: #e95678;">Ano</span>, <span style="color: #e95678;">Ects</span>, <span style="color: #e95678;">Propina</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span><span style="color: #b877db;">}</span>

  id :: <span style="color: #e95678;">Id</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span><span style="color: #b877db;">}</span>
  nome :: <span style="color: #e95678;">Nome</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span>,<span style="color: #e95678;">Desconhecido</span><span style="color: #b877db;">}</span>
  curso :: <span style="color: #e95678;">Curso</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span>,<span style="color: #e95678;">Desconhecido</span><span style="color: #b877db;">}</span>
  ano :: <span style="color: #e95678;">Ano</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span>,<span style="color: #e95678;">Desconhecido</span><span style="color: #b877db;">}</span>
  ects :: <span style="color: #e95678;">Ects</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span>,<span style="color: #e95678;">Desconhecido</span><span style="color: #b877db;">}</span>
  propina :: <span style="color: #e95678;">Propina</span> <span style="color: #b877db;">-&gt;</span> <span style="color: #b877db;">{</span><span style="color: #e95678;">V</span>,<span style="color: #e95678;">F</span>,<span style="color: #e95678;">Desconhecido</span><span style="color: #b877db;">}</span>
</pre>
</div>

<p>
Um aluno é caracterizado por ter :
</p>
<ul class="org-ul">
<li>um id</li>
<li>nome</li>
<li>frequentar um curso</li>
<li>andar num certo ano</li>
<li>ter ECTS</li>
<li>algo que identifique se ele já pagou a propina</li>
</ul></li>

<li>Conhecimento

<ul class="org-ul">
<li><p>
Definir o conhecimento falso
</p>
<div class="org-src-container">
<pre class="src src-prolog">-aluno(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>):-
    not(aluno(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)),
    not(exception(aluno(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>))).
</pre>
</div></li>

<li><p>
Valores nulos do tipo interdito
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #21bfc2;">nulo</span>(interdito).
</pre>
</div></li>

<li><p>
Excepcoes
</p>
<div class="org-src-container">
<pre class="src src-prolog"> exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,nulo,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,nulo,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,nulo,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,incerto,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,interdito,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,incerto,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,incerto,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">P</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,nulo,<span style="color: #e95678;">P</span>).
 exception(aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">_</span>)):- aluno(<span style="color: #e95678;">I</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,incerto).
 exception(aluno(<span style="color: #f09383; font-weight: bold;">3456</span>,carlos,mdi,<span style="color: #f09383; font-weight: bold;">1</span>,<span style="color: #e95678;">Ects</span>,sim)):-
     <span style="color: #e95678;">Ects</span> &lt; <span style="color: #f09383; font-weight: bold;">45</span>, (-<span style="color: #f09383; font-weight: bold;">1</span>) &lt; <span style="color: #e95678;">Ects</span> .
 exception(aluno(<span style="color: #f09383; font-weight: bold;">45678</span>,duarte,miec,<span style="color: #e95678;">A</span>,<span style="color: #f09383; font-weight: bold;">180</span>,sim)):-
     <span style="color: #e95678;">A</span> &lt; <span style="color: #f09383; font-weight: bold;">6</span>, <span style="color: #f09383; font-weight: bold;">2</span> &lt; <span style="color: #e95678;">A</span>.
 exception(aluno(<span style="color: #f09383; font-weight: bold;">67890</span>,filipe,<span style="color: #e95678;">C</span>,<span style="color: #f09383; font-weight: bold;">1</span>,<span style="color: #e95678;">E</span>,nao)):-
     ( <span style="color: #e95678;">C</span> == lfis <span style="color: #b877db;">;</span> <span style="color: #e95678;">C</span> == lefis ),
     ( <span style="color: #e95678;">E</span> == <span style="color: #f09383; font-weight: bold;">45</span> <span style="color: #b877db;">;</span> <span style="color: #e95678;">E</span> == <span style="color: #f09383; font-weight: bold;">54</span>).
 exception(aluno(<span style="color: #f09383; font-weight: bold;">78901</span>,<span style="color: #e95678;">N</span>,lcc,<span style="color: #f09383; font-weight: bold;">3</span>,<span style="color: #f09383; font-weight: bold;">180</span>,sim)):-
     <span style="color: #e95678;">N</span> == gisela <span style="color: #b877db;">;</span> <span style="color: #e95678;">N</span> == gisele<span style="color: #b877db;">;</span> <span style="color: #e95678;">N</span> == gabriel.
</pre>
</div></li>

<li><p>
Conhecimento
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #21bfc2;">aluno</span>(<span style="color: #f09383; font-weight: bold;">12345</span>,ana,lei,<span style="color: #f09383; font-weight: bold;">1</span>,<span style="color: #f09383; font-weight: bold;">60</span>,sim).
<span style="color: #21bfc2;">aluno</span>(<span style="color: #f09383; font-weight: bold;">23456</span>,beatriz,lcc,<span style="color: #f09383; font-weight: bold;">2</span>,<span style="color: #f09383; font-weight: bold;">60</span>,nao).
<span style="color: #21bfc2;">aluno</span>(<span style="color: #f09383; font-weight: bold;">56789</span>,eva,miec,<span style="color: #f09383; font-weight: bold;">4</span>,<span style="color: #f09383; font-weight: bold;">240</span>,incerto).
<span style="color: #21bfc2;">aluno</span>(<span style="color: #f09383; font-weight: bold;">89012</span>,heitor,interdito,<span style="color: #f09383; font-weight: bold;">1</span>,<span style="color: #f09383; font-weight: bold;">10</span>,nao).
<span style="color: #21bfc2;">aluno</span>(<span style="color: #f09383; font-weight: bold;">90123</span>,ivo,incerto,<span style="color: #f09383; font-weight: bold;">2</span>,<span style="color: #f09383; font-weight: bold;">180</span>,sim).
</pre>
</div></li>
</ul></li>

<li><p>
Invariantes
</p>
<div class="org-src-container">
<pre class="src src-prolog">+aluno(<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>):: (
     findall(<span style="color: #e95678;">Id</span>, (aluno(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">_</span>), (<span style="color: #e95678;">A</span> &gt; <span style="color: #f09383; font-weight: bold;">5</span> <span style="color: #b877db;">;</span> <span style="color: #e95678;">E</span> &gt; <span style="color: #f09383; font-weight: bold;">300</span>)), <span style="color: #e95678;">S</span> ),
     length(<span style="color: #e95678;">S</span>,<span style="color: #f09383; font-weight: bold;">0</span>)).

+aluno(<span style="color: #f09383; font-weight: bold;">89012</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>)::(
     findall(<span style="color: #e95678;">A</span>, (aluno(<span style="color: #f09383; font-weight: bold;">89012</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">X</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>,<span style="color: #e95678;">_</span>), not(nulo(<span style="color: #e95678;">X</span>))), <span style="color: #e95678;">R</span>),
     length(<span style="color: #e95678;">R</span>,<span style="color: #f09383; font-weight: bold;">0</span>)
 ).
</pre>
</div></li>
<li><p>
Inserir conhecimento
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #4e5059;">%% </span><span style="color: #4e5059;">validar conhecimento</span>
<span style="color: #21bfc2;">valid</span>(<span style="color: #b877db;">[]</span>).
<span style="color: #21bfc2;">valid</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">A</span><span style="color: #b877db;">|</span><span style="color: #e95678;">T</span><span style="color: #b877db;">]</span>):- <span style="color: #e95678;">A</span>, valid(<span style="color: #e95678;">T</span>).

<span style="color: #4e5059;">%% </span><span style="color: #4e5059;">Inserir conhecimento</span>
<span style="color: #21bfc2;">inserir</span>(<span style="color: #e95678;">New</span>):- assert(<span style="color: #e95678;">New</span>).
<span style="color: #21bfc2;">inserir</span>(<span style="color: #e95678;">New</span>):- retract(<span style="color: #e95678;">New</span>), <span style="color: #b877db;">!</span>, fail.

<span style="color: #4e5059;">%% </span><span style="color: #4e5059;">Adicionar um novo predicado obedecendo os invariantes</span>
<span style="color: #21bfc2;">new_predicado</span>(<span style="color: #e95678;">New</span>):-
    findall(<span style="color: #e95678;">X</span>,<span style="color: #e95678;">New</span>::+<span style="color: #e95678;">X</span>,<span style="color: #e95678;">S</span>),
    inserir(<span style="color: #e95678;">New</span>),
    valid(<span style="color: #e95678;">S</span>).

<span style="color: #4e5059;">%% </span><span style="color: #4e5059;">Adicionar um novo aluno</span>
<span style="color: #21bfc2;">add_aluno</span>(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>):- new_predicado(aluno(<span style="color: #e95678;">Id</span>,<span style="color: #e95678;">N</span>,<span style="color: #e95678;">C</span>,<span style="color: #e95678;">A</span>,<span style="color: #e95678;">E</span>,<span style="color: #e95678;">P</span>)).
</pre>
</div></li>
</ol>
</div>
