1sem/IA/testes/teste_2014-15.org
** Questao 2
#+begin_src prolog
si(Questao,verdadeiro):- Questao.
si(Questao,falso):- -Questao.
si(Questao,desconhecido):- not(Questao), not(-Questao).
%- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -
% Extensao do predicado queryConjuncao: [Questao],Resposta -> {V,F,D}
% capaz de fazer a conjunção de uma lista de questões
% produzindo um resultado final
queryConjuncao([],R).
queryConjuncao([Q],R) :- si(Q,R).
queryConjuncao([Q|Qs], R) :- si(Q, R1), queryConjuncao(Qs,R2), conjuncao(R1,R2,R).

% Extensao do predicado queryDisjuncao: [Questao],Resposta -> {V,F,D}
% capaz de fazer a disjunção de uma lista de questões
% produzindo um resultado final
queryDisjuncao([],R).
queryDisjuncao([Q],R) :- si(Q,R).
queryDisjuncao([Q|Qs], R) :- si(Q, R1), queryDisjuncao(Qs,R2), disjuncao(R1,R2,R).

%- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -
% Extensao do predicado query: (Operador, Questao1, Questao2),Resposta -> {V,F,D}
% capaz de fazer a conjunção ou a disjunção de duas questões
% produzindo um resultado final
query(('OR',Q1,Q2),R) :- query(Q1,R1), query(Q2,R2), disjuncao(R1,R2,R).
query(('AND',Q1,Q2),R) :- query(Q1,R1), query(Q2,R2), conjuncao(R1,R2,R).
query(Q,R) :- si(Q,R).

%- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -
% Extensao do meta-predicado queries: [Questao], Resposta -> {V,F,D}
% capaz de fazer a conjunção e/ou disjunção de uma lista de questões
% produzindo um resultado final
queries([],verdadeiro).
queries([Q],R) :- si(Q,R).
queries([Q1,'AND'|Qs],R) :- si(Q1,R1),
                            queries(Qs,R2),
                            conjuncao(R1,R2,R).
queries([Q1,'OR'|Qs],R) :- si(Q1,R1),
                           queries(Qs,R2),
                           disjuncao(R1,R2,R).

%- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -
% Extensao do predicado conjuncao: X,Y -> {V,F,D}
conjuncao(verdadeiro,verdadeiro,verdadeiro).
conjuncao(verdadeiro,desconhecido,desconhecido).
conjuncao(desconhecido,verdadeiro,desconhecido).
conjuncao(desconhecido,desconhecido,desconhecido).
conjuncao(falso,_,falso).
conjuncao(_,falso,falso).

% Extensao do predicado disjuncao: X,Y -> {V,F,D}
disjuncao(verdadeiro,_,verdadeiro).
disjuncao(_,verdadeiro,verdadeiro).
disjuncao(falso,falso,falso).
disjuncao(falso,desconhecido,desconhecido).
disjuncao(desconhecido,falso,desconhecido).
disjuncao(desconhecido,desconhecido,desconhecido).
#+end_src

