1sem/IA/testes/teste_2014-15.html
<div id="outline-container-orgdbc8756" class="outline-3">
<h3 id="orgdbc8756"><span class="section-number-3">1.1.</span> Questao 2</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #21bfc2;">si</span>(<span style="color: #e95678;">Questao</span>,verdadeiro):- <span style="color: #e95678;">Questao</span>.
<span style="color: #21bfc2;">si</span>(<span style="color: #e95678;">Questao</span>,falso):- -<span style="color: #e95678;">Questao</span>.
<span style="color: #21bfc2;">si</span>(<span style="color: #e95678;">Questao</span>,desconhecido):- not(<span style="color: #e95678;">Questao</span>), not(-<span style="color: #e95678;">Questao</span>).
<span style="color: #4e5059;">%</span><span style="color: #4e5059;">- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do predicado queryConjuncao: [Questao],Resposta -&gt; {V,F,D}</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">capaz de fazer a conjun&#231;&#227;o de uma lista de quest&#245;es</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">produzindo um resultado final</span>
<span style="color: #21bfc2;">queryConjuncao</span>(<span style="color: #b877db;">[]</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queryConjuncao</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q</span><span style="color: #b877db;">]</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queryConjuncao</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q</span><span style="color: #b877db;">|</span><span style="color: #e95678;">Qs</span><span style="color: #b877db;">]</span>, <span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>, <span style="color: #e95678;">R1</span>), queryConjuncao(<span style="color: #e95678;">Qs</span>,<span style="color: #e95678;">R2</span>), conjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).

<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do predicado queryDisjuncao: [Questao],Resposta -&gt; {V,F,D}</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">capaz de fazer a disjun&#231;&#227;o de uma lista de quest&#245;es</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">produzindo um resultado final</span>
<span style="color: #21bfc2;">queryDisjuncao</span>(<span style="color: #b877db;">[]</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queryDisjuncao</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q</span><span style="color: #b877db;">]</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queryDisjuncao</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q</span><span style="color: #b877db;">|</span><span style="color: #e95678;">Qs</span><span style="color: #b877db;">]</span>, <span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>, <span style="color: #e95678;">R1</span>), queryDisjuncao(<span style="color: #e95678;">Qs</span>,<span style="color: #e95678;">R2</span>), disjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).

<span style="color: #4e5059;">%</span><span style="color: #4e5059;">- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do predicado query: (Operador, Questao1, Questao2),Resposta -&gt; {V,F,D}</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">capaz de fazer a conjun&#231;&#227;o ou a disjun&#231;&#227;o de duas quest&#245;es</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">produzindo um resultado final</span>
<span style="color: #21bfc2;">query</span>((<span style="color: #fab795;">'OR'</span>,<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">Q2</span>),<span style="color: #e95678;">R</span>) :- query(<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">R1</span>), query(<span style="color: #e95678;">Q2</span>,<span style="color: #e95678;">R2</span>), disjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">query</span>((<span style="color: #fab795;">'AND'</span>,<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">Q2</span>),<span style="color: #e95678;">R</span>) :- query(<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">R1</span>), query(<span style="color: #e95678;">Q2</span>,<span style="color: #e95678;">R2</span>), conjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">query</span>(<span style="color: #e95678;">Q</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>,<span style="color: #e95678;">R</span>).

<span style="color: #4e5059;">%</span><span style="color: #4e5059;">- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do meta-predicado queries: [Questao], Resposta -&gt; {V,F,D}</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">capaz de fazer a conjun&#231;&#227;o e/ou disjun&#231;&#227;o de uma lista de quest&#245;es</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">produzindo um resultado final</span>
<span style="color: #21bfc2;">queries</span>(<span style="color: #b877db;">[]</span>,verdadeiro).
<span style="color: #21bfc2;">queries</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q</span><span style="color: #b877db;">]</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queries</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q1</span>,<span style="color: #fab795;">'AND'</span><span style="color: #b877db;">|</span><span style="color: #e95678;">Qs</span><span style="color: #b877db;">]</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">R1</span>),
                            queries(<span style="color: #e95678;">Qs</span>,<span style="color: #e95678;">R2</span>),
                            conjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).
<span style="color: #21bfc2;">queries</span>(<span style="color: #b877db;">[</span><span style="color: #e95678;">Q1</span>,<span style="color: #fab795;">'OR'</span><span style="color: #b877db;">|</span><span style="color: #e95678;">Qs</span><span style="color: #b877db;">]</span>,<span style="color: #e95678;">R</span>) :- si(<span style="color: #e95678;">Q1</span>,<span style="color: #e95678;">R1</span>),
                           queries(<span style="color: #e95678;">Qs</span>,<span style="color: #e95678;">R2</span>),
                           disjuncao(<span style="color: #e95678;">R1</span>,<span style="color: #e95678;">R2</span>,<span style="color: #e95678;">R</span>).

<span style="color: #4e5059;">%</span><span style="color: #4e5059;">- - - - - - - - - - - - - - - - - - - - - - - - - - -  -  -  -  -   -</span>
<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do predicado conjuncao: X,Y -&gt; {V,F,D}</span>
<span style="color: #21bfc2;">conjuncao</span>(verdadeiro,verdadeiro,verdadeiro).
<span style="color: #21bfc2;">conjuncao</span>(verdadeiro,desconhecido,desconhecido).
<span style="color: #21bfc2;">conjuncao</span>(desconhecido,verdadeiro,desconhecido).
<span style="color: #21bfc2;">conjuncao</span>(desconhecido,desconhecido,desconhecido).
<span style="color: #21bfc2;">conjuncao</span>(falso,<span style="color: #e95678;">_</span>,falso).
<span style="color: #21bfc2;">conjuncao</span>(<span style="color: #e95678;">_</span>,falso,falso).

<span style="color: #4e5059;">% </span><span style="color: #4e5059;">Extensao do predicado disjuncao: X,Y -&gt; {V,F,D}</span>
<span style="color: #21bfc2;">disjuncao</span>(verdadeiro,<span style="color: #e95678;">_</span>,verdadeiro).
<span style="color: #21bfc2;">disjuncao</span>(<span style="color: #e95678;">_</span>,verdadeiro,verdadeiro).
<span style="color: #21bfc2;">disjuncao</span>(falso,falso,falso).
<span style="color: #21bfc2;">disjuncao</span>(falso,desconhecido,desconhecido).
<span style="color: #21bfc2;">disjuncao</span>(desconhecido,falso,desconhecido).
<span style="color: #21bfc2;">disjuncao</span>(desconhecido,desconhecido,desconhecido).
</pre>
</div>
</div>
</div>
</div>
