1sem/IA/testes/teste_2014-15.org
* Grupo 2

1. Na linguagem de programação em lógica PROLOG, a expressão 'A=..B' representa a comparação dos valores decimais de A e B.

   Falso, representa o funtor de um dado termo, colocando numa lista o nome do termo e os seus respetivos arguemtos.

   Exemplo:
  #+begin_src prolog
amigos(arroz,batata(2)) =.. L.
  #+end_src

  :Result:
  #+begin_src prolog
L = [amigos, arroz, batata(2)]
  #+end_src

1. Na linguagem de programação prolog, o operador '=:=/2' representa a comparação dos valores aritméticos calculados de cada operando.

   Verdadeiro. Em oposicao ao operador '==\2', o '=:=\2' calcula primeiro os valores aritmeticos e só depois compara o resultado obtido de ambos os lados.

   Exemplo:
  #+begin_src prolog
3 == 2 + 1.

Falso

3 =:= 2 + 1.

Verdadeiro
  #+end_src

2. 'negação forte' e 'negação explicta' são duas designações para identificar a negação por falha de prova.

   ???

   Falso, a 'negacao explicita' acontece por falha na prova, ja a 'negação forte' acontece devido a falha de predicados

3. Em termos da representação de conhecimento imperfeito, os valores nulos tanto podem assumir a representação de conhecimento positivo como de conhecimento negativo.

   Falso.

4. Invariantes denotam regras de teste à consistência do conhecimento, com os quais se representa conhecimento positivo ou conhecimento negativo.

   + Falso, porque os invariantes apenas servem para garantir que a base de conhecimento continua válida após a remoção ou adicição de um dado conhecimento.

* Grupo 3
1. Questão

   V, V, V, F, V.
