1sem/IA/testes/teste_2014-15.html

<div id="outline-container-org8f78206" class="outline-2">
<h2 id="org8f78206"><span class="section-number-2">2.</span> Grupo 2</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Na linguagem de programação em lógica PROLOG, a expressão &rsquo;A=..B&rsquo; representa a comparação dos valores decimais de A e B.
</p>

<p>
Falso, representa o funtor de um dado termo, colocando numa lista o nome do termo e os seus respetivos arguemtos.
</p>

<p>
Exemplo:
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #21bfc2;">amigos</span>(arroz,batata(<span style="color: #f09383; font-weight: bold;">2</span>)) =.. <span style="color: #e95678;">L</span>.
</pre>
</div>

<p>
:Result:
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #e95678;">L</span> = <span style="color: #b877db;">[</span>amigos, arroz, batata(<span style="color: #f09383; font-weight: bold;">2</span>)<span style="color: #b877db;">]</span>
</pre>
</div></li>

<li><p>
Na linguagem de programação prolog, o operador &rsquo;=:=/2&rsquo; representa a comparação dos valores aritméticos calculados de cada operando.
</p>

<p>
Verdadeiro. Em oposicao ao operador &rsquo;<code>=\2', o '</code>:=\2&rsquo; calcula primeiro os valores aritmeticos e só depois compara o resultado obtido de ambos os lados.
</p>

<p>
Exemplo:
</p>
<div class="org-src-container">
<pre class="src src-prolog"><span style="color: #f09383; font-weight: bold;">3</span> == <span style="color: #f09383; font-weight: bold;">2</span> + <span style="color: #f09383; font-weight: bold;">1</span>.

<span style="color: #e95678;">Falso</span>

<span style="color: #f09383; font-weight: bold;">3</span> =:= <span style="color: #f09383; font-weight: bold;">2</span> + <span style="color: #f09383; font-weight: bold;">1</span>.

<span style="color: #e95678;">Verdadeiro</span>
</pre>
</div></li>

<li><p>
&rsquo;negação forte&rsquo; e &rsquo;negação explicta&rsquo; são duas designações para identificar a negação por falha de prova.
</p>

<p>
???
</p>

<p>
Falso, a &rsquo;negacao explicita&rsquo; acontece por falha na prova, ja a &rsquo;negação forte&rsquo; acontece devido a falha de predicados
</p></li>

<li><p>
Em termos da representação de conhecimento imperfeito, os valores nulos tanto podem assumir a representação de conhecimento positivo como de conhecimento negativo.
</p>

<p>
Falso.
</p></li>

<li>Invariantes denotam regras de teste à consistência do conhecimento, com os quais se representa conhecimento positivo ou conhecimento negativo.

<ul class="org-ul">
<li>Falso, porque os invariantes apenas servem para garantir que a base de conhecimento continua válida após a remoção ou adicição de um dado conhecimento.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf2a95ad" class="outline-2">
<h2 id="orgf2a95ad"><span class="section-number-2">3.</span> Grupo 3</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><p>
Questão
</p>

<p>
V, V, V, F, V.
</p></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mari§</p>
<p class="date">Created: 2021-12-13 Mon 17:24</p>
</div>
</body>
</html>
